Cambios en el ms5 y adicicons de nuevos docs
